/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   _del_error.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mschimme <mschimme@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/01/17 15:08:40 by mschimme          #+#    #+#             */
/*   Updated: 2021/04/10 21:03:22 by mschimme         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <cwr.h>

/*
**	//? Использование под вопросом, при текущей конфигурации структуры.
*/

void	ft_del_error(void *ptr, size_t size)
{
	(void)size;
	if (ptr)
		free((void *)ptr);
}
